{
  "name": "Milk Bread",
  "servingSize" : 5,
  "editServing" : false,
  "editRatio" : 1,
  "isFavourite" : false,
  "haveReview" : false,
  "slogan" : "Recipe Slogan Goes Here",
  "avgRating" : 5,
  "newRating" : null,
  "reviewAmt" : 888,
  "ingredients" : 
  [
    {
      "amt": 300,
      "type": "g",
      "food": "bread flour"
    },
    {
      "amt": 2,
      "type": "tsp",
      "food": "fast acting yeast"
    },
    {
      "amt": 120,
      "type": "ml",
      "food": "milk"
    },
    {
      "amt": 30,
      "type": "g",
      "food": "unsalted butter"
    },
    {
      "amt": 1,
      "type": "tsp",
      "food": "salt"
    },
    {
      "amt": 3, 
      "type": "tbsp",
      "food": "sugar"
    },
    {
      "amt": 1,
      "type": null,
      "food": "egg"
    }
  ],
  "pictureData": [
    {
      "url": "https://www.carolinescooking.com/wp-content/uploads/2019/07/Japanese-milk-bread-tin-photo.jpg",
      "name": "Bread 1"
    },
    {
      "url": "https://www.carolinescooking.com/wp-content/uploads/2021/01/Japanese-milk-bread-featured-pic-sq.jpg",
      "name": "Bread 2"
    },
    {
      "url": "https://www.carolinescooking.com/wp-content/uploads/2019/07/Japanese-milk-bread-tin-picture.jpg",
      "name": "Bread 3"
    }  
  ],
  "time": [
    {
      "prep" : [
        {
          "hour" : 0,
          "minute": 20
        }
      ],
      "cook" : [
        {
          "hour" : 1,
          "minute" : 5
        }
      ]
    }
  ],
  "directions": [
      "Measure out the remaining ingredients into a large bowl (flour, yeast, milk, melted butter, sugar, salt and egg). Add the cooled tangzhong - I gently beat the egg into the tangzhong first to both save the tangzhong being too thick and help egg to mix better but you don't need to, just make sure you mix it well. Mix all the ingredients together then knead, either in mixer or by hand on a floured surface. Add a little more flour if needed.",
      "Once the dough is no longer sticky, transfer to a lightly oiled bowl. Cover and leave to rise in a relatively warm place until doubled - around 1 hour.",
      "Once it has risen, knock back the dough, divide into three pieces. Set the other pieces to one side and roll one piece into an oval.",
      "Fold one side of dough over to halfway across the remaining dough then fold the other side on top so you have three layers (see photos above). Gently roll slightly, if needed, then roll up the piece of dough as you would a cinnamon roll.",
      "Repeat with the other pieces of dough then put all three rolls of dough in an oiled loaf pan - 9x5in (22x12cm) or slightly smaller.",
      "Cover and leave to rise again until the loaf is just reaching the top of the pan. Preheat oven to 350F/175C. Lightly beat the egg and brush the top of the loaf with egg wash.",
      "Bake the loaf for approx 30 minutes until golden brown. If it browns too fast, tent with foil for the last part of cooking. Turn onto a cooling rack to cool before slicing."
  ]
}